In [2]:
import pandas as pd
import numpy as np

# Step 2. Create 3 differents Series, each of length 100, as follows:

# The first a random number from 1 to 4

In [15]:
data = np.random.randint(1, 4, size=100)
serie1 = pd.Series(data)

# The second a random number from 1 to 3

In [16]:
serie2 = pd.Series(np.random.randint(1, 3, size=100))

# The third a random number from 10,000 to 30,000

In [17]:
serie3 = pd.Series(np.random.randint(10000, 30000, size=100))

# Step 3. Create a DataFrame by joinning the Series by column
# Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [19]:
df = pd.DataFrame({'bedrs': serie1, 'bathrs': serie2, 'price_sqr_meter':serie3})
df.head()

   bedrs  bathrs  price_sqr_meter
0      2       2            15486
1      3       2            18173
2      3       1            22831
3      2       1            23466
4      1       1            29701

# Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [22]:
bigcolumn = pd.concat([serie1, serie2, serie3], axis=0).to_frame(name='bigcolumn')
bigcolumn

    bigcolumn
0           2
1           3
2           3
3           2
4           1
..        ...
95      29290
96      18821
97      11996
98      21747
99      19996

[300 rows x 1 columns]

# Step 6. Ops it seems it is going only until index 99. Is it true?

In [25]:
bigcolumn.tail()

    bigcolumn
95      29290
96      18821
97      11996
98      21747
99      19996

# Step 7. Reindex the DataFrame so it goes from 0 to 299

In [26]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn.tail()

     bigcolumn
295      29290
296      18821
297      11996
298      21747
299      19996